[
  {
    "path": "posts/2023-06-27-2023-ipl-analysis/",
    "title": "2023 IPL Analysis",
    "description": "Who were the best batters and bowlers in the 2023 IPL? I use Adjusted Run Rate and Adjusted Average to examine the season's performances.",
    "author": [
      {
        "name": "Seth Benson",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2023-06-27",
    "categories": [],
    "contents": "\r\nThe 2023 IPL concluded at the end of last month. With over 70 games played (and at least 14 per team), it provided a large sample size to judge player performance. But how should these performances be judged and what is the best way to evaluate how much a player benefits their team in the t20 franchise games? The most traditional form is just aggregate stats, tracking the total runs over the tournament will tell you that Shubman Gill had the best performance of batsmen. Likewise, subjective awards like Team of the Tournament can be used. But a rigorous evaluation metric requires both objectivity and nuanced analysis that goes beyond these two forms. This is where “impact” style metrics are needed. There are existing metrics that meet this need, but they generally suffer from two pitfalls. First, many metrics like Cricviz’s Impact have restricted public access and are not openly available to explore. Second, some of the metrics that are transparent, such as Cricketingview’s Misbah/Jogi measures or Himanish Ganjoo’s runs-above-average, fail to consider the impact of wicket-taking and preserving.\r\nSo, here I seek to address these limitations with two open-source metrics. I present a new way of analyzing efficiency with Adjusted Run Rate and introduce a way of evaluating the effect of preserving or taking wickets with the Adjusted Average metric. This is done by evaluating a player’s strike rate/economy and average in relation to the overs they bat/bowl in, the venue they are playing at, and the opposition they face.\r\nFirst, how efficiently did different batsmen score in the tournament? This is where batting Adjusted Run Rate (ARR) is used. Simply put, ARR measures how much more or less runs per ball a batter produces than would be expected. An ‘expected’ score is calculated for each ball they face by using the average runs scored in the venue and over they are in and adjusting for the quality of the bowler they are facing. So a batter with an ARR of 0 would be batting at an exactly average rate, while a batter with an ARR of 0.1 would be producing one tenth of a run per ball more than what would be expected. Below you can see how all batters that scored at least 100 runs did on this metric graphed alongside their economy (note: dot size reflects total runs scored). When adjusting for betting situations, you can see that some players with similar strike rates have very different Adjusted Run Rates. For example, Kyle Mayers (0.179 ARR), who primarily batted in earlier overs with a lower expected run rate, had a much higher Adjusted Run Rate than Andre Russell (-0.120 ARR), even though Russell had a higher strike rate. However, strike rate and ARR are still largely correlated. Glen Maxwell and Rashid Khan had the top two Adjusted Run Rates in the tournament while also having the top two strike rates.\r\n\r\n\r\n\r\nThe same metric can be used to judge how economical bowlers were. Bowling Adjusted Run Rate (ARR) is calculated just like batting ARR except it examines the runs conceded by a bowler. So, like economy, a lower number is better. A bowler with a -0.1 ARR concedes one tenth of a run per ball less than expected. Below is the ARR and economy for all bowlers that bowled at least 100 balls in the 2023 IPL with dot size scaled by balls bowled. Like batting ARR and strike rate, we can see that bowling ARR is highly correlated with economy. Ravichandran Ashwin had the lowest ARR of the season among qualified bowlers while also having one of the lowest economies. There are some outliers though, such as Jofra Archer, who had a much better than average average ARR (-0.143) despite conceding nine and a half runs an over. This reflects the fact that he frequently face above average batters throughout the season.\r\n\r\n\r\n\r\nHowever, scoring rate is not the only way a player can impact their team’s performance. While wickets have less of an impact on t20 than other forms of the game, batters that can stay at the crease longer and bowlers that can take more wickets help their put their teams in a position to win. The Adjusted Average metric calculates this impact after adjusting for a player’s situation. This is calculated very similarly to ARR, where each ball a batter faces or bowler bowls receives an expected average determined by the venue, over, and opposition. Then, a players Adjusted Average is determined by difference between their actual average and the mean expected average of balls they faced/bowled. This metric is shown below for both batters and bowlers performance compared to their simple average. For batting, it most heavily rewards batters that had high averages despite frequently batting in middle or late overs where more wickets are typically taken. Adjusted Average for bowlers is much more correlated with Average than for batters. This is likely due to the fact that, while some bowlers may be more used at the beginning of an inning or during death overs, bowlers overall play in a higher variety of overs than batters. Most teams emply a mixed bowling attack rather than having their bowlers stay on to use all for of their overs at once.\r\n\r\n\r\n\r\n\r\nOverall, these metrics serve as starting points for a deeper experimentation with quantifying player performance in cricket. One of the important things to test is what factors are most important when contextualizing performance. For example, elements like the wickets remaining in an innings have been used by others to predict expected runs but are missing in my calculations. Additionally, an important next step is creating a cohesive player performance metric that combines Adjusted Run Rate and Adjusted Average. Doing so will shed more light on the importance of run rate vs preserving wickets in the modern t20 game.\r\nCode and data for the project is available here, and feel free to direct any suggestions and questions to wickistats@gmail.com.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-06-27T13:44:33-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-06-09-page-overview/",
    "title": "Page Overview",
    "description": "This is a post from seth",
    "author": [
      {
        "name": "Seth Benson",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2023-06-09",
    "categories": [],
    "contents": "\r\nDistill is a publication format for scientific and technical writing, native to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-06-09T14:54:50-04:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to WickiStats Blog",
    "description": "Welcome to our new blog, WickiStats Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Seth Benson",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2023-06-09",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-06-09T14:55:11-04:00",
    "input_file": {}
  }
]
